app/Http/Controllers/CommentController.php

    public function store(Post $post) {
        request()->validate([
            'content' => 'required'
        ]);
        $post->comments()->create([
           'user_id' => auth()->user()->id,
           'content' => request()->get('content')
        ]);
---
INSERT INTO `comments` (`user_id`, `content`, `post_id`, `updated_at`, `created_at`) VALUES (2, 'xc dsfghjkvbn,', 1, '2022-12-01 10:04:48', '2022-12-01 10:04:48')

    public function destroy(Comment $comment) {
        $comment->destroy($comment->id);
---
DELETE FROM `comments` WHERE `id` = 6