app/Http/Controllers/PostController.php

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts` WHERE exists (SELECT * FROM `categories` WHERE `posts`.`category_id` = `categories`.`id` and `slug` = 'expedita') and exists (SELECT * FROM `users` WHERE `posts`.`user_id` = `users`.`id` and `username` = 'mejdi5') ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (1, 2, 3)
SELECT * FROM `categories`
SELECT * FROM `users`
---
    public function index () {
        return view('posts.index', [
            'posts'=> Post::latest()->with('category', 'author')->search(request(['search', 'category', 'author']))->get(),
            'currentCategory' => Category::get()->firstWhere('slug' , request(['category'][0])),
            'currentAuthor' => User::get()->firstWhere('username' , request(['author'][0])),
            'categories' => Category::all(),
            'authors' => User::all()
        ]);

SELECT * FROM `categories`
---
    public function create () {
        return view('posts.create', [
            'categories' => Category::all()
        ]);

INSERT INTO `posts` (`title`, `excerpt`, `body`, `user_id`, `category_id`, `updated_at`, `created_at`) VALUES ('fghn', 'dcvfgbhn', 'dcvfbgn,hjgfdffgvbnh,nj,jgfdffghjyrfefrghjkjdfgnh,jkuyfdggbhnjkyut', 1, '1', '2022-12-01 07:54:26', '2022-12-01 07:54:26')
SELECT * FROM `posts` WHERE `id` in (1)
---
    public function store() {
        request()->validate([
            'title' => 'required',
            'excerpt' => ['required', 'min:3', 'max:255'],
            'body' => ['required', 'min:50'],
        ]);
        Post::create([
            'title' => request('title'),
            'excerpt' => request('excerpt'),
            'body' => request('body'),
            'user_id' => auth()->user()->id,
            'category_id' => request('category'),
        ]);
        return redirect('/')->with('success', 'post added with success');

DELETE FROM `posts` WHERE `id` = 4
SELECT * FROM `posts` WHERE `id` in (4)
---
    public function destroy(Post $post) {
        $post->destroy($post->id);
        return redirect('/')->with('success', 'post deleted');

SELECT * FROM `categories`
---
    public function edit (Post $post) {
        return view('posts.edit', [
            'post' => $post,
            'categories' => Category::all()
        ]);