app/Http/Controllers/RegisterController.php

    public function store() {
        $attributes = request()->validate([
            'name' => 'required',
            'username' => ['required', 'min:3', 'max:255'],
            'email' => ['required', 'email', 'max:255', ValidationRule::unique('users', 'email')],
            'password' => ['required', 'min:8', 'max:255']
        ]);
        $attributes['password'] = bcrypt($attributes['password']);
        $user = User::create($attributes);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('mohamed', 'mohamed123', 'mohamed@gmail.com', '$2y$10$GLlIvcL8NO4kU3mSsMzuKOcqBuXUmMvPsdDRt.qmbQG5XQhA3zBHy', '2022-11-29 07:24:49', '2022-11-29 07:24:49')